# Select Rows That Contain An Item In A List

In [1]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/Kavi/anaconda/lib/python3.6/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

### Create Data

In [2]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (234, 'Bill James', 22, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (621, 'Betty Bob', NULL, 'F', 'Petaluma', 1);
INSERT INTO criminals VALUES (162, 'Jaden Ado', 49, 'M', NULL, 0);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (411, 'Bob Iton', NULL, 'M', 'San Francisco', 0);

[]

### Select Rows That Contain An Item In A List

In [12]:
%%sql 

SELECT * FROM criminals
WHERE city IN ('Santa Rosa', 'Petaluma');

[(412, 'James Smith', 15, 'M', 'Santa Rosa', 1),
 (234, 'Bill James', 22, 'M', 'Santa Rosa', 0),
 (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0),
 (621, 'Betty Bob', None, 'F', 'Petaluma', 1),
 (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0),
 (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0)]

Source: https://chrisalbon.com/sql/select_rows_that_contain_an_item_in_a_list.html